In [6]:
import pandas as pd

In [7]:
import numpy as np

In [13]:
data = pd.DataFrame({'company':["GOOGLE","GOOGLE","META","META","TESLA","TESLA"],
                  'Person':["준원","수혁","종현","서영","재영","혜민"],
                  'Sales':[200,120,340,124,243,350]})

In [14]:
df = pd.DataFrame(data)

In [15]:
df

  company Person  Sales
0  GOOGLE     준원    200
1  GOOGLE     수혁    120
2    META     종현    340
3    META     서영    124
4   TESLA     재영    243
5   TESLA     혜민    350

In [17]:
df.groupby('company')

In [18]:
by_comp = df.groupby("company")

In [19]:
by_comp.mean()
# Groupby라는 내장 매소드를 통해 "company"칼럼에 있는 내용을 기준으로 나머지 데이터들을 합쳐준다.

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_15088\821838057.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_comp.mean()

         Sales
company
GOOGLE   160.0
META     232.0
TESLA    296.5

In [20]:
by_comp.std()

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_15088\3391457442.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_comp.std()

              Sales
company
GOOGLE    56.568542
META     152.735065
TESLA     75.660426

In [21]:
by_comp.count()

         Person  Sales
company
GOOGLE        2      2
META          2      2
TESLA         2      2

In [22]:
by_comp.max()

        Person  Sales
company
GOOGLE      준원    200
META        종현    340
TESLA       혜민    350

In [23]:
by_comp.min()

        Person  Sales
company
GOOGLE      수혁    120
META        서영    124
TESLA       재영    243

In [24]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
company
GOOGLE    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
META      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
TESLA     2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0

In [ ]:
# by_comp.descibe().transpose() # transpose 매소드는 위 내용의 행과 열을 바꿔서 볼 수 있도록 해줌

In [25]:
hong = by_comp.describe().transpose()

In [26]:
hong['GOOGLE']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOGLE, dtype: float64